
### :robot: Terraform Report
---
##### Plan: `1` to add, `1` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/c14e6355-e668-40e2-8ab9-d434eaacf017/resourceGroups/infra-cluster-manager/providers/Microsoft.ContainerService/managedClusters/innovats-cluster-manager"
        name                                = "innovats-cluster-manager"
        tags                                = {
            "environment" = "development"
            "owner"       = "devops-team"
            "project"     = "platform-engineering"
        }
        # (23 unchanged attributes hidden)

      ~ default_node_pool {
            name                         = "admnodes"
            tags                         = {}
            # (21 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_kubernetes_cluster_node_pool.app_node_pool will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "app_node_pool" {
      + auto_scaling_enabled  = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = "/subscriptions/c14e6355-e668-40e2-8ab9-d434eaacf017/resourceGroups/infra-cluster-manager/providers/Microsoft.ContainerService/managedClusters/innovats-cluster-manager"
      + max_count             = 4
      + max_pods              = (known after apply)
      + min_count             = 1
      + mode                  = "User"
      + name                  = "appnodes"
      + node_count            = (known after apply)
      + node_labels           = (known after apply)
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "environment" = "development"
          + "owner"       = "devops-team"
          + "project"     = "platform-engineering"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D2ps_v5"
      + vnet_subnet_id        = "/subscriptions/c14e6355-e668-40e2-8ab9-d434eaacf017/resourceGroups/infra-cluster-manager/providers/Microsoft.Network/virtualNetworks/main-vnet/subnets/aks-subnet"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#11542500900`](https://github.com/innovats-hub/aks-cluster-manager/actions/runs/11542500900) - commit 6d05c079f9f96d0cce4d69efbdc2983ce4febf9f
